<!-- add-pr-comment:eks_plan -->

# production/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_metric_alarm.logs-1-celery-error-throttling-warning[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-1-celery-error-throttling-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-1-celery-error-throttling-warning" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - alarm_description                     = "One Celery throttling error in 1 minute" -> null
      - alarm_name                            = "logs-1-celery-error-throttling-warning" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:logs-1-celery-error-throttling-warning" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "logs-1-celery-error-throttling-warning" -> null
      - metric_name                           = "celery-error-throttling" -> null
      - namespace                             = "LogMetrics" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - period                                = 60 -> null
      - region                                = "ca-central-1" -> null
      - statistic                             = "Sum" -> null
      - tags_all                              = {} -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-10-celery-error-shutdown-critical[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-10-celery-error-shutdown-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-10-celery-error-shutdown-critical" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - alarm_description                     = "Ten Celery shutdown errors in 1 minute" -> null
      - alarm_name                            = "logs-10-celery-error-shutdown-critical" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:logs-10-celery-error-shutdown-critical" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "logs-10-celery-error-shutdown-critical" -> null
      - metric_name                           = "celery-error-shutdown" -> null
      - namespace                             = "LogMetrics" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ] -> null
      - period                                = 60 -> null
      - region                                = "ca-central-1" -> null
      - statistic                             = "Sum" -> null
      - tags_all                              = {} -> null
      - threshold                             = 10 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-duplicate-record-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-duplicate-record-critical" {
      ~ alarm_description                     = "Ten Celery duplicate record errors in 1 minute" -> "200 Celery duplicate record errors in 1 minute"
        id                                    = "logs-celery-error-duplicate-record-critical"
        tags                                  = {}
      ~ threshold                             = 10 -> 200
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-duplicate-record-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-duplicate-record-warning" {
      ~ alarm_description                     = "One Celery duplicate record error in 1 minute" -> "50 Celery duplicate record errors in 1 minute"
        id                                    = "logs-celery-error-duplicate-record-warning"
        tags                                  = {}
      ~ threshold                             = 1 -> 50
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-notification-not-found-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-notification-not-found-critical" {
      ~ alarm_description                     = "Ten Celery notification not found errors in 1 minute" -> "200 Celery notification not found errors in 1 minute"
        id                                    = "logs-celery-error-notification-not-found-critical"
        tags                                  = {}
      ~ threshold                             = 10 -> 200
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-notification-not-found-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-notification-not-found-warning" {
      ~ alarm_description                     = "One Celery notification not found error in 1 minute" -> "50 Celery notification not found errors in 1 minute"
        id                                    = "logs-celery-error-notification-not-found-warning"
        tags                                  = {}
      ~ threshold                             = 1 -> 50
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-shutdown-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-shutdown-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "30 Celery shutdown errors in 1 minute"
      + alarm_name                            = "logs-celery-error-shutdown-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-shutdown"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-shutdown-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-shutdown-warning" {
      ~ alarm_description                     = "One Celery shutdown error in 1 minute" -> "10 Celery shutdown errors in 1 minute"
        id                                    = "logs-celery-error-shutdown-warning"
        tags                                  = {}
      ~ threshold                             = 1 -> 10
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-throttling-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-throttling-critical" {
      ~ alarm_description                     = "Ten Celery throttling errors in 1 minute" -> "3000 Celery throttling errors in 1 minute"
        id                                    = "logs-celery-error-throttling-critical"
        tags                                  = {}
      ~ threshold                             = 10 -> 3000
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-throttling-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-throttling-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "1000 Celery throttling errors in 1 minute"
      + alarm_name                            = "logs-celery-error-throttling-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-throttling"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1000
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-xray-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-xray-critical" {
      ~ alarm_description                     = "Ten Celery X-Ray errors in 1 minute" -> "Twenty-five Celery X-Ray errors in 1 minute"
        id                                    = "logs-celery-error-xray-critical"
        tags                                  = {}
      ~ threshold                             = 10 -> 25
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-xray-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-celery-error-xray-warning" {
      ~ alarm_description                     = "One Celery X-Ray error in 1 minute" -> "Five Celery X-Ray errors in 1 minute"
        id                                    = "logs-celery-error-xray-warning"
        tags                                  = {}
      ~ threshold                             = 1 -> 5
        # (21 unchanged attributes hidden)
    }
  # aws_cloudwatch_query_definition.celery-count-known-errors[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-count-known-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
        ]
      + name                = "Celery / Count of known errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^notify-celery/
            | filter @message like /CELERY_KNOWN_ERROR/
            | parse @message /CELERY_KNOWN_ERROR::(?<error>[a-zA-Z_]+)/
            | stats count(*) as total by error
            | sort total desc
            | limit 20
        EOT
      + region              = "ca-central-1"
    }
  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version        = "1.34.2-20260129" -> "1.34.3-20260209"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (17 unchanged attributes hidden)
        # (3 unchanged blocks hidden)
    }
  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20260211162443761100000002" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260211162443761100000002" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }
Plan: 4 to add, 9 to change, 3 to destroy.

# --- End of Plan 1 ---

```